Table of Contents
 Class ResultOfInteractionDiagramPlane
Namespace
IdeaRS.OpenModel.Result
Assembly
IdeaRS.OpenModel.dll
Result of Interaction diagram in plane
[Obfuscation(Feature = "renaming")]
public class ResultOfInteractionDiagramPlane : SectionResultBase
Inheritance
object
SectionResultBase
ResultOfInteractionDiagramPlane
Inherited Members
 SectionResultBase.Loading
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Constructors
 ResultOfInteractionDiagramPlane()
Constructor
public ResultOfInteractionDiagramPlane()
Properties
 LoadChart
Polygon of Load
public PolygonPointID LoadChart { get; set; }
Property Value
PolygonPointID
 Plane
Polygon of interaction diagram plane
public PolygonPointID Plane { get; set; }
Property Value
PolygonPointID
 Edit this page